/* # */
/* # This file contains all the word, phrases and sentences that are output */
/* # to a user by Baruwa. They are all here so that you can translate */
/* # them into your language. */
/* # You should only edit what is on the right of each "=". */
/* # If you set the "Language Strings" option in Baruwa.conf to be a */
/* # ruleset (or even a function!) then you can output responses in different */
/* # languages to different users and customers. */
/* # */
/* # Used in spam header */
"Blacklisted" = "blacklisted";
"Whitelisted" = "whitelisted";
"NotSpam" = "not spam";
"Spam" = "spam";
/* # used when creating VirusWarning.txt */
"TheEntireMessage" = "the entire message";
"NotNamed" = "not named";
/* # used for sysadmin notifications */
"NoticeSubject" = "Warning: E-mail viruses detected";
"FullHeadersAre" = "Full headers are";
/* # used for delivering truly disinfected attachments */
"Disinfected" = "Disinfected";
/* # used for virus report in unparsable messages */
"CantAnalyze" = "Could not analyze message";
/* # used for virus report in unparsable TNEF messages */
"BadTNEF" = "Could not parse Outlook Rich Text attachment";
/* # used for creating sysadmin notifications */
"NoticeHeading" = "The following e-mail messages were found to have viruses in them";
/* # used when SpamAssassin has timed out too often */
"SADisabled" = "Disabled due to %d consecutive timeouts";
/* # used when message size exceeds configured SpamAssassin max message size */
"SATooLarge" = "Message larger than max testing size";
/* # used when trying to use SpamAssassin on a bad message with no headers */
"SANoHeaders" = "Message had no headers";
/* # used when creating SpamAssassin results header */
"score" = "score";
"required" = "required";
"SATimedOut" = "timed out";
/* # used when creating reports for messages with dangerous content */
"PartialMessage" = "Fragmented messages cannot be scanned and are removed";
"FoundIFrame" = "Found dangerous IFrame tag in HTML message";
"FoundForm" = "Found a form in HTML message";
"FoundScript" = "Found a script in HTML message";
"FoundObject" = "Found dangerous Object Codebase/Data tag in HTML message";
"ExternalBody" = "External message bodies cannot be scanned and are removed";
"EudoraLongMIME" = "Eudora long-MIME-boundary attack";
/* # used when detecting denial-of-service attacks */
"DOSAttack" = "Denial of Service attack in message!";
/* # used when detecting+blocking (un)encrypted messages */
"encrypted" = "Message was encrypted";
"unencrypted" = "Message was not encrypted";
/* # used in spam reports */
"SpamAssassin" = "SpamAssassin";
/* # Used in virus reports */
"Report" = "Report";
/* # Used in virus reports */
"TooBig" = "Message is too large";
"AttachmentTooLarge" = "Attachment is too large";
"AttachmentTooSmall" = "Attachment is too small";
"TooManyAttachments" = "Too many attachments in message";
/* # Used in filename/filetype/content reports */
"Baruwa" = "Baruwa";
/* # Used in passworded-archives checks */
"UnreadableArchive" = "Message contained archive which could not be read";
"PasswordedArchive" = "Message contained password-protected archive";
"NonPasswordedArchive" = "Message contained archive which was not password-protected";
"ArchiveTooDeep" = "Message contained archive nested too deeply";
/* # Used in Postmaster notices */
"NoticeVirusInfected" = "Virus Detected";
"NoticeFilenameInfected" = "Bad Filename Detected";
"NoticeOtherInfected" = "Other Bad Content Detected";
"NoticePasswordProtected" = "Password-protected Archive Detected";
"NoticeNonPasswordProtected" = "Non-password-protected Archive Detected";
"NoticePrefix" = "The following e-mails were found to have";
/* # Used in Phishing Fraud attack detections. The "End" must close all the */
/* # HTML highlighting done in the "Start". */
"PossibleFraudStart" = "<font color='red'><b>Baruwa has detected a possible fraud attempt from";
"PossibleFraudEnd" = "claiming to be</b></font>";
"NumericLinkWarning" = "<font color='red'><b>Baruwa warning: numerical links are often malicious:</b></font>";
/* # Used in "From:" header of many reports */
"PostmasterName" = "Baruwa";
/* # Used in simple filename allow/deny rules (not filename.rules.conf) */
"FoundBlockedFilename" = "Blocked Filename Detected";
"FoundBlockedFiletype" = "Blocked Filetype Detected";
/* # Used in SpamAssassin cache results headers */
"cached" = "cached";
"notcached" = "not cached";
/* # Used when testing message size against Max Spam Check Size */
"skippedastoobig" = "not spam (too large)";
/* # Used in the watermarking spam report */
"watermarked" = "watermarked";
"NoticeSizeInfected" = "Attachment detected outside size limits";
/* # Used in Phishing Fraud attack detections. The "End" must close all the */
/* # HTML highlighting done in the "Start". */
"DefiniteFraudStart" = "<font color='red'><b>Baruwa has detected definite fraud in the website at";
"DefiniteFraudEnd" = ". Do <i>not</i> trust this website:</b></font>";
/* # Used in reports of attacks on HTML::Parser (used for analysing HTML messages) */
"HTMLParserAttack" = "Baruwa was attacked by a Denial Of Service attack, and has therefore \ndeleted this part of the message. Please contact your e-mail providers \nfor more information if you need it, giving them the whole of this report.";
/* # Used in reports of messages that have caused Baruwa to crash */
"KilledBaruwa" = "Message attempted to kill Baruwa";
